package org.anastdronina.gyperborea;

public class Traits {

    private String[] traits = {
            "Бездонный желудок",
            "Деревенщина",
            "Пацифист",
            "Гастрофобия",
            "Брезгливый",
            "Громкий храп",
            "Анемия",
            "Нарколепсия",
            "Медленная обучаемость",
            "Трипофобия",
            "Неконструктивный",
            "Руки из лапши",
            "Торопыжка",
            "Некультурный",
            "Жаворонок",
            "Способный ученик",
            "Технарь",
            "Декоратор",
            "Буйвол",
            "Болтун",
            "Веган",
            "Гурман"
    };

    private String[] descriptions = {
            "У него в желудке, вероятно, находятся чёрные дыры",
            "Явно не блещет умом",
            "Боится насилия",
            "Имеет глубокое недоверие к кулинарному мастерству",
            "Имеет деликатный характер и не может заботиться о растениях",
            "Даже в космосе каждый может услышать его храп",
            "У него проблемы с тем, чтобы в прямом смысле идти в ногу с другими",
            "Может заснуть в любое время в любом месте",
            "Намного медленнее обучается, но, чёрт возьми, он пытается",
            "Боится дыр, что делает невозможным их копать",
            "Не способен создавать даже самые простые структуры",
            "Его руки обладают прочностью как у приготовленной лапши",
            "Лёгок, словно перышко",
            "Не признаёт прекрасные вещи",
            "У него появляется ощущение свежести и лёгкости утром",
            "Получает новые навыки с удивительной скоростью",
            "Любит совать палки в планы колонии… в хорошем смысле",
            "«Передвиньте немного левее…»",
            "У него мышцы с мышцами",
            "Обладает хорошим тактом и бла бла бла",
            "Ему подходит даже самая безвкусная пища",
            "У него очень изысканный вкус"
    };

    public String[] getTraits() {
        return traits;
    }

    public String[] getDescriptions() {
        return descriptions;
    }
}
